Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ВКМ_ВыполенныеКлиентуРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор КАК Договор,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРабот КАК СтоимостьЧасаРабот,
	|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаНачалаДоговора КАК ДоговорВКМ_ДатаНачалаДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаОкончанияДоговора КАК
	|		ДоговорВКМ_ДатаОкончанияДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВидДоговора КАК ДоговорВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполенныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Клиент,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРабот,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаНачалаДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаОкончанияДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Дата";
	
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 	Если Выборка.ДоговорВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	 		Отказ = Истина;
	 		Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "У договора проставлен вид не Абонентское обслуживание.";
			Сообщение.Сообщить();
	 	КонецЕсли;
	 	
	 	Если  Выборка.Дата < Выборка.ДоговорВКМ_ДатаНачалаДоговора Тогда
	 		Отказ = Истина;
	 		Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата начала договора больше, чем дата документа";
			Сообщение.Сообщить();
	 	КонецЕсли;
	 	
	 	Если Выборка.Дата > Выборка.ДоговорВКМ_ДатаОкончанияДоговора Тогда
	 		Отказ = Истина;
	 		Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата окончания договора меньше, чем дата документа";
			Сообщение.Сообщить();
	 	КонецЕсли;
		 		
		 	Движение = Движения.ВКМ_ВыполенныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = Выборка.Клиент;
			Движение.Договор = Выборка.Договор;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРабот;
	 
	 КонецЦикла;
	
КонецПроцедуры