
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРабот.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРабот.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Ложь;
	Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРабот.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
КонецПроцедуры
